{
  "almakkiyah":{
    "name": "Al-Makkiyah",
    "images": [
      {
        "url": "media/almakkiyah/home.jpeg"
      },
      {
        "url": "media/almakkiyah/shop.jpeg"
      },
      {
        "url": "media/almakkiyah/join.jpeg"
      },
      {
        "url": "media/almakkiyah/contact.jpeg"
      },
      {
        "url": "media/almakkiyah/about.jpeg"
      },
      {
        "url": "media/almakkiyah/product.jpeg"
      },
      {
        "url": "media/almakkiyah/preview.jpeg"
      },
      {
        "url": "media/almakkiyah/balance.jpeg"
      },
      {
        "url": "media/almakkiyah/balance-payout.jpeg"
      },
      {
        "url": "media/almakkiyah/balance-donate.jpeg"
      },
      {
        "url": "media/almakkiyah/account.jpeg"
      },
      {
        "url": "media/almakkiyah/orders.jpeg"
      },
      {
        "url": "media/almakkiyah/checkout.jpeg"
      },
      {
        "url": "media/almakkiyah/checkout-2.jpeg"
      },
      {
        "url": "media/almakkiyah/thanks.jpeg"
      }
    ],
    "desc": "<p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Al-Makkiyah is a website selling skincare products from one of our clients located in Kediri, East Java, Indonesia. In this website there are some features like the existing sales website, but the difference on this website is the existence of a member affiliate system that allows customers to become affiliates and earn additional income by buying and distributing certain products in the hope of increasing the number of permanent customers on al-makkiyah.com.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Al-Makkiyah is an enterprise user of Merchant.id that allows al-makkiyah to use all the features of the dashboard that Merchant.id has. One of the most important of them is omni.merchant.id. Al-Makkiyah manages all the orders that have been obtained from al-makkiyah.com through omni.merchant.id. In the creation of al-makkiyah.com we spent about 3 months starting from the initial configuration until finally al-makkikiyah.com began to operate fully. al-makkiyah.com was built with the tech stack Svelte Framework, jQuery, Native CSS + Bootstrap v4.6, and Custom PHP Laravel Frameworks.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;In the development process of al-makkiyah.com, I was assisted by a colleague at PT. Codelaris Inti Sinergi. During the development process I worked more with the UI/UX and Backend Developer team. From the beginning of the creation of al-makkiyah.com, the UI/UX team prepared design mockups in Figma. After the mockup is done for all pages, at that point I began to do slicing design from Figma to Svelte. And that&#39;s how the process of crafting continues until page by page is complete and correctly in accordance with the initial planning of construction. Not to forget that after the entire website was successfully built, the Tester team tested al-makkiyah.com. If at the time of testing a bug has been detected, then the bug will be immediately reported to the developer team for immediate correction and so on until the testing process does not find a bug at all.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;The hardest challenge in making al-makkiyah.com was when I was already processing the data integration of the Backend Developer team, where sometimes there was an impediment on the API that had been made by Backend Developers which resulted in me having to wait for the backend developer team in the process of revision of the impediment until the mentioned impediment was properly overcome.</p><p style='text-align:justify'>So yeah, that&#39;s the process in the making of almakkiyah.com</p>"
  },
  "merchant-id":{
    "name": "Merchant.id Landingpage",
    "images": [
      {
        "url": "media/merchant-id/home.jpeg"
      },
      {
        "url": "media/merchant-id/bisnis.jpeg"
      },
      {
        "url": "media/merchant-id/content-creator.jpeg"
      },
      {
        "url": "media/merchant-id/integration.jpeg"
      },
      {
        "url": "media/merchant-id/price.jpeg"
      }
    ],
    "desc": "<p>&nbsp; &nbsp; &nbsp;Merchant.id is the main product of PT Codelaris Inti Sinergi. Merchant.id landingpage here serves as a promotional tool for various Merchant Apps ecosystems. You can see more about the Merchant Apps project <a href='http://portfolio-bagasfa.web.app/portfolio/merchant-apps' target='_blank'>here</a>. This landingpage was built using only HTML, CSS, and Javascript because this landingpage does not require dynamic data and is more concerned with the beauty of the interface design for potential customers and customers to be interested in Merchant.id ecosystem products. The process of making this landingpage only takes approximately 3 days because it only uses the tech stack mentioned earlier.</p><p>&nbsp; &nbsp; &nbsp;This landingpage has actually been around since 2019, but this landingpage needs a refreshed look to make it more attractive to potential customers to use the Merchant.id ecosystem. And finally a total refresh of the landingpage appearance was carried out in 2021, at which time I was in charge of refreshing the appearance of this landingpage interface. Before executing the refresh task, I waited for the UI/UX team to complete the latest mockup design of this landingpage and after that I sliced the design from Figma into a form of code very comfortably and really enjoyed the process. Besides that, I also did personal research about landingpage landingpage that is out there, then I took some ideas from the research process, one of the ideas that I poured on this landingpage is to add scrolling animation so that the landingpage looks more interactive in the eyes of the user and improve some typography that has been made by the UI / UX team to be more attractive in the eyes of the user. Of course, I don&#39;t forget to ask permission from the UI / UX team to avoid miscommunication why some components / designs are different from what they have previously designed in Figma.</p><p>&nbsp; &nbsp; &nbsp;That&#39;s about the history of the creation and function of this landingpage, as always thank you for those of you who have taken the time to read the origin of the merchant.id landingpage.<br />You can also visit the merchant.id landingpage directly <a href='http://merchant.id' target='_blank'>here</a></p>"
  },
  "merchant-builder":{
    "name": "Merchant Builder Landingpage",
    "images": [
      {
        "url": "media/merchant-builder/home.jpeg",
        "is_mobile": false
      },
      {
        "url": "media/merchant-builder/home-mobile.jpeg",
        "is_mobile": true
      }
    ],
    "desc": "<p>&nbsp; &nbsp; &nbsp;Merchant Builder Landingpage is a landingpage owned by merchant.id which is used for promotional media for one of the products of the Merchant Apps Ecosystem, namely Merchant Landingpage Builder. In making this landingpage, it took only 1 day because this landingpage only has 1 page and does not use dynamic data so it does not require backend technology. This landingpage was built using tech stack HTML, Bootstrap CSS, and jQuery.</p><p>&nbsp; &nbsp; &nbsp;In early 2023, PT Codelaris Inti Sinergi plans to create a landingpage itself for the Merchant Landingpage Builder product, because this product is the most frequently used and most needed at that time. So that when Merchant Landingpage Builder has its own landingpage, the possibility of increasing users will increase. And like before, during the development process I was accompanied by the UI / UX team to design the mockup of this landingpage. And after the mockup was made, I immediately implemented the design so that it could be released to the public as soon as possible. At the time of making this landingpage I was a bit surprised because my working time expectations were beyond expectations, because the processing time I expected could be 2 to 3 days, but instead finished in just one day. It&#39;s actually funny that during the process I didn&#39;t feel any excessive challenges considering I had previously made a landingpage for merchant.id which you can see <a href='http://portfolio-bagasfa.web.app/portfolio/merchant-id' target='_blank'>here</a>. So I already have a reference for the next landingpage work and some resources are also available indirectly.</p><p>&nbsp; &nbsp; &nbsp;So maybe that&#39;s just a brief history of Merchant Builder landingpage development that I can provide, because the development process that I do is more or less the same as the merchant.id landingpage development process. As always, thank you for those of you who have taken the time to read about my portfolio this time.</p>"
  },
  "merchant-apps":{
    "name": "Merchant Apps Ecosystem",
    "images": [
      {
        "url": "media/merchant-apps/welcome-2.png"
      },
      {
        "url": "media/merchant-apps/register.png"
      },
      {
        "url": "media/merchant-apps/login.png"
      },
      {
        "url": "media/merchant-apps/profile.png"
      },
      {
        "url": "media/merchant-apps/add-ons.png"
      },
      {
        "url": "media/merchant-apps/balance.png"
      },
      {
        "url": "media/merchant-apps/notif.png"
      },
      {
        "url": "media/merchant-apps/notif-2.png"
      },
      {
        "url": "media/merchant-apps/home-builder.png"
      },
      {
        "url": "media/merchant-apps/landingpage-ov.png"
      },
      {
        "url": "media/merchant-apps/contact.png"
      },
      {
        "url": "media/merchant-apps/contact-ov.png"
      },
      {
        "url": "media/merchant-apps/home-omni.png"
      },
      {
        "url": "media/merchant-apps/home-omni-2.png"
      },
      {
        "url": "media/merchant-apps/orders-1.png"
      },
      {
        "url": "media/merchant-apps/orders-2.png"
      },
      {
        "url": "media/merchant-apps/product-ov.png"
      },
      {
        "url": "media/merchant-apps/inbound.png"
      },
      {
        "url": "media/merchant-apps/inbound-2.png"
      },
      {
        "url": "media/merchant-apps/auto-followup.png"
      },
      {
        "url": "media/merchant-apps/payment.png"
      },
      {
        "url": "media/merchant-apps/home-domain.png"
      },
      {
        "url": "media/merchant-apps/home-cod.png"
      },
      {
        "url": "media/merchant-apps/tracking.png"
      },
      {
        "url": "media/merchant-apps/home-form.png"
      },
      {
        "url": "media/merchant-apps/home-form-2.png"
      },
      {
        "url": "media/merchant-apps/form-ov.png"
      },
      {
        "url": "media/merchant-apps/home-wa.png"
      }
    ],
    "desc": "<p style='text-align:justify'>&nbsp; &nbsp; &nbsp;The Merchant Apps Ecosystem encompasses a suite of cutting-edge products provided by merchant.id, under the ownership and management of PT Codelaris Inti Sinergi. At its inception, the flagship product, Merchant Landingpage Builder, quickly gained traction among prominent clients due to its superior lightweight design compared to similar offerings. Subsequently, the introduction of Merchant Omni necessitated the separation of the two applications, resulting in the emergence of several complementary products. Among these products are Merchant Account, Merchant Affiliate, Merchant Domain, Merchant COD, Merchant Form, and Merchant CRM.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Merchant Account serves as a comprehensive dashboard, offering robust management capabilities for user accounts, subscriptions, personal data, affiliate dashboards, add-on purchases, and user balances. Enterprise users can efficiently administer their admin staff&#39;s access to all their merchant applications through this centralized platform.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Merchant Builder stands out as a dashboard application facilitating the seamless management of landing pages. Users can choose between Merchant Builder and <em>Elementor Builder</em> for their landing page creation process, with an array of free templates available. Each landing page is enriched with analytics created by merchant.id, empowering users with valuable insights.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Merchant Omni serves as an advanced order management application, boasting features such as the printing of sales reports, expense management, product authentication, warehouse management, discount management, and more. It integrates seamlessly with <em>Midtrans </em>for payment processing and courier services, streamlining the distribution of merchandise for sellers.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Merchant Domain, a dedicated application, oversees the management of user-owned domains, offering a complimentary <em>side.link</em> domain to each Merchant Apps user. This enables users to fully leverage their landing pages created within Merchant Builder.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Merchant COD is a specialized application designed for tracking orders from Merchant Omni utilizing the <span style='color:#df6a26'>Cash On Delivery (COD)</span> payment method. With features including order tracking, a list of COD orders in process, and filtered order lists based on different timeframes, the application enhances financial management for users.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Merchant Form facilitates the creation of purchase form pages for products added to Merchant Omni. This simplifies the purchasing process for customers, allowing for automated payments on created forms, seamlessly integrated with <em>Midtrans </em>and the seller&#39;s chosen delivery service.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Merchant CRM takes customer-seller relationships to new heights with its integration of <em>WhatsApp Messenger</em>. Sellers can directly communicate with customers, utilize the broadcast feature for advertising, and leverage automated messages through the Automation Followup feature in Merchant Omni.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Merchant Affiliate, now presented as an independent application, manages the affiliate system, inviting potential users to join the Merchant Apps Ecosystem. This program offers lucrative commissions for each registered customer using the affiliate link, providing comprehensive analytics for link development and commission monitoring.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;The development of this comprehensive Merchant Apps Ecosystem was a collaborative effort involving various teams at PT Codelaris Inti Sinergi. The UI / UX team spearheaded a refreshing redesign of the interface, while Backend Developers played a crucial role in seamlessly integrating data. The technology stack employed includes Embedded JavaScript, Svelte Framework, Bootstrap CSS, jQuery, Moment.js, Ladda, Navigo, Lodash, Apexchart.js, Webpack, Workerman, Custom PHP Laravel, MySQL, Github, Gitbash, Laragon, and Nginx.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;This ambitious project spanned from 2021 to 2023, achieving remarkable success by facilitating hundreds of thousands or perhaps millions of customer orders within the Merchant Apps Ecosystem. It stands as a pinnacle accomplishment in the author&#39;s professional journey with PT Codelaris Inti Sinergi.</p>"
  },
  "trueve-id":{
    "name": "Trueve.id",
    "images": [
      {
        "url": "media/trueve/home.jpg"
      },
      {
        "url": "media/trueve/shop.jpg"
      },
      {
        "url": "media/trueve/about.jpg"
      },
      {
        "url": "media/trueve/product.jpg"
      },
      {
        "url": "media/trueve/testimoni.jpg"
      },
      {
        "url": "media/trueve/account.jpg"
      },
      {
        "url": "media/trueve/orders.jpg"
      },
      {
        "url": "media/trueve/checkout.jpg"
      },
      {
        "url": "media/trueve/thanks.jpg"
      }
    ],
    "desc": "<p style='text-align:justify'>&nbsp; &nbsp; &nbsp;In the dynamic business landscape of the third quarter of 2022, Trueve.id and Merchant.id forged a strategic alliance to create a cutting-edge sales website. This collaboration, marked by meticulous planning and innovative solutions, stands as a testament to the prowess of both entities in navigating the digital realm.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Trueve.id, leveraging the expertise of their in-house freelance team, meticulously crafted a visionary UI design. This blueprint, aimed at achieving responsiveness across mobile, tablet, and desktop devices, laid the foundation for a sophisticated online platform. Stepping into the realm of development, the collaboration enlisted the talents of Fullstack Developer <a href='https://linkedin.com/in/musaviardabilly' target='_blank'>Musavi Ardabilly</a>, who, with finesse, tackled the intricacies of frontend development.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;The tech stack employed in this project exemplifies a strategic amalgamation of industry-leading tools. Figma emerged as the primary instrument for UI design, while Embedded JavaScript, jQuery, Bootstrap CSS, and Custom Native CSS played pivotal roles in delivering a seamless and visually captivating frontend experience. This orchestration of technologies aimed not just for functionality but for an aesthetically pleasing user interface.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Simultaneously, the backend development, orchestrated by the Merchant.id team, showcased a robust foundation. Custom PHP Laravel, MySQL, and Nginx formed the backbone of the system, ensuring reliability, security, and scalability. The collaboration unfolded like a synchronized dance, with each element seamlessly integrating into the next.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;The project&#39;s pace was nothing short of extraordinary, with the UI work reaching completion in under a month. However, no venture is without its challenges. During the subsequent data integration phase, unexpected hurdles arose. The frontend, while visually stunning, revealed missing components that threatened to disrupt the seamless flow of data.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;Demonstrating resilience and ingenuity, the development team, led by me navigated these challenges. Improvisation became the order of the day, with missing components crafted on the spot to ensure a smooth data integration process. This ability to pivot swiftly in the face of adversity underscored the team&#39;s agility and commitment to project success.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;The final culmination of this collaboration resulted in a fully integrated website, harmonizing seamlessly with Merchant.id assets, including servers, UI components, and the order management system. Trueve.id, now equipped with a powerful e-commerce platform, can effortlessly list its merchandise products, thanks to the meticulous planning and execution of this project.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;In conclusion, this project stands as a testament to the power of collaboration, where creative vision met technical excellence. The successful integration of design and development, coupled with the agility to overcome unforeseen challenges, showcases the resilience and innovation embedded in the core of this dynamic partnership. As the project concludes, gratitude is extended to all stakeholders, underscoring the importance of teamwork and collective expertise in achieving a triumphant outcome in the realm of digital commerce.</p>"
  },
  "dizaglow":{
    "name": "Dizaglow",
    "images": [
      {
        "url": "media/dizaglow/home.png"
      },
      {
        "url": "media/dizaglow/shop.png"
      },
      {
        "url": "media/dizaglow/product.png"
      },
      {
        "url": "media/dizaglow/orders.png"
      },
      {
        "url": "media/dizaglow/checkout.png"
      },
      {
        "url": "media/dizaglow/thanks.png"
      }
    ],
    "desc": "<p style='text-align:justify'>&nbsp; &nbsp; &nbsp;In the dynamic realm of skincare commerce, Dizaglow, a trailblazing skincare product enterprise, embarked on a transformative journey in early 2023. Eager to carve its digital presence, the visionary brand partnered with merchant.id, a stalwart in the e-commerce landscape, to birth its own online sales platform. The canvas for this digital masterpiece was to be painted with the strokes of the Merchant Apps Ecosystem, a robust framework for merchandise management.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;With ink still wet on the collaboration contract, the maestros of design at merchant.id UI/UX team embarked on a creative odyssey, fashioning a mockup that would encapsulate Dizaglow&#39;s essence. The design, a visual symphony, was tendered to the Dizaglow team for appraisal, inviting their discerning gaze to ensure harmony with their brand vision. Through the dance of revisions, the design metamorphosed into a true reflection of Dizaglow&#39;s aesthetic.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;The crescendo approached as the meticulously crafted design found its way to the nimble fingers of the Frontend Developer team. Undeterred by the complexities, the team, fueled by the synergy of creativity and precision, brought the vision to life. The tech orchestra, led by the Svelte Framework, JavaScript, Bootstrap CSS, Custom PHP Laravel, MySQL, Workerman, and choreographed by GitHub for version control, played in harmony, weaving a digital tapestry that seamlessly blended form and function.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;As the website unfurled its virtual storefront to the world, it not only met but exceeded expectations. The Backend Developer team, akin to unseen architects, ensured the infrastructure was robust, allowing the website to gracefully handle the surge of national orders. The collaboration, a symphony of technology and business acumen, reached its zenith by the close of 2023.</p><p style='text-align:justify'>&nbsp; &nbsp; &nbsp;In bidding adieu to this chapter, gratitude echoes from both parties. Dizaglow for the opportunity to have its vision crystallized digitally, and merchant.id for the privilege of contributing to this digital opus. To the astute readers, thank you for indulging in the enthralling narrative of this business voyage, where innovation met execution, and success adorned the shelves of e-commerce.</p>"
  }
}